app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY Created_at DESC
---
    def index
        @posts = Post.all.order("Created_at DESC")

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a new"], ["content", "new text after deploy\r\n"], ["created_at", "2021-10-07 12:32:32.633145"], ["updated_at", "2021-10-07 12:32:32.633145"]]
---
    def create
@post = Post.new(post_params)
        if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "a final"], ["content", "final test\r\n"], ["updated_at", "2021-10-07 12:35:33.387175"], ["id", 7]]
---
    def update
        @post = Post.find(params[:id])
        if @post.update(post_params)